Revit 2026 API

# LabelUtilsGetLabelForSymbol Method

---

Gets the user-visible name for a symbol.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GetLabelForSymbol(
	ForgeTypeId symbolTypeId
)
```
```vb
Public Shared Function GetLabelForSymbol (
	symbolTypeId As ForgeTypeId
) As String
```
```cpp
public:
static String^ GetLabelForSymbol(
	ForgeTypeId^ symbolTypeId
)
```
```fsharp
static member GetLabelForSymbol :
        symbolTypeId : ForgeTypeId -> string
```

#### Parameters

symbolTypeId ForgeTypeId
     Identifier of the symbol to get the user-visible name.

#### Return Value

String Returns the user-visible name for a symbol.

| Exception | Condition |
| --- | --- |
| ArgumentException | Symbol must have a definition. |
| ArgumentNullException | A non-optional argument was null |

The name is obtained in the current Revit language.

#### Reference

LabelUtils Class

Autodesk.Revit.DB Namespace